# AssemblyDifferenceNamingCategory Properties

---
The AssemblyDifferenceNamingCategory type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyDifference)
| NamingCategoryId1|  Naming category id of the first assembly
| NamingCategoryId2|  Naming category id of the second assembly
Top
#### Reference
AssemblyDifferenceNamingCategory Class
Autodesk.Revit.DB Namespace